content/posts/Nicholas_Rescher.md
+++
title = "Nicholas Rescher"
author = ["Cameron Smith"]
lastmod = 2020-09-20T20:24:28-04:00
slug = "Nicholas_Rescher"
draft = false
+++

## [process philosophy]({{< relref "process_philosophy" >}}), [Alfred North Whitehead]({{< relref "Alfred_North_Whitehead" >}}), [pragmatism]({{< relref "pragmatism" >}}) {#process-philosophy--process-philosophy-dot-md--alfred-north-whitehead--alfred-north-whitehead-dot-md--pragmatism--pragmatism-dot-md}


## biographical {#biographical}


### [Rescher, Nicholas | Internet Encyclopedia of Philosophy](<https://www.iep.utm.edu/rescher/>) {#rescher-nicholas-internet-encyclopedia-of-philosophy--https-www-dot-iep-dot-utm-dot-edu-rescher}

1.  [Life](<https://www.iep.utm.edu/rescher/#H1>)
2.  [Main Topics of Rescher’s Work](<https://www.iep.utm.edu/rescher/#H2>)
3.  [Pragmatism](<https://www.iep.utm.edu/rescher/#H3>)
4.  [Objectivity and Rationality](<https://www.iep.utm.edu/rescher/#H4>)
5.  [Truth](<https://www.iep.utm.edu/rescher/#H5>)
6.  [Evolutionary Epistemology](<https://www.iep.utm.edu/rescher/#H6>)
7.  [Pragmatic Idealism](<https://www.iep.utm.edu/rescher/#H7>)
8.  [Philosophy of Science](<https://www.iep.utm.edu/rescher/#H8>)
9.  [Logic and Conceptual Schemes](<https://www.iep.utm.edu/rescher/#H9>)
10. [Social Philosophy](<https://www.iep.utm.edu/rescher/#H10>)
11. [Ethical Issues](<https://www.iep.utm.edu/rescher/#H11>)

_In his system of pragmatic idealism, the activity of the human mind plays a key role and makes a fundamental contribution to knowledge, while “valid” knowledge contributes to practical success. Rescher also defends a coherence theory of truth in a manner differing in a significant way from that endorsed by classical idealism. He draws an original distinction between a pragmatism of the left and a pragmatism of the right. The first is a flexible type of pragmatism that endorses a greatly enhanced cognitive relativism. The second envisions the pragmatist enterprise as a source of cognitive security. Rescher sees Charles S. Peirce, Clarence I. Lewis and himself as adherents to the pragmatism of the right, and William James, F. S. C. Schiller and Richard Rorty as representatives of the pragmatism of the left, with John Dewey standing in a middle of the road position._ — via [Rescher, Nicholas | Internet Encyclopedia of Philosophy](<https://www.iep.utm.edu/rescher/>)


## [Process Metaphysics An introduction to process philosophy by Nicholas Rescher in 1996]({{< relref "Process_Metaphysics_An_introduction_to_process_philosophy_by_Nicholas_Rescher_in_1996" >}}) {#process-metaphysics-an-introduction-to-process-philosophy-by-nicholas-rescher-in-1996--process-metaphysics-an-introduction-to-process-philosophy-by-nicholas-rescher-in-1996-dot-md}


## [process philosophy a survey of basic issues by Nicholas Rescher in 2000]({{< relref "process_philosophy_a_survey_of_basic_issues_by_Nicholas_Rescher_in_2000" >}}) {#process-philosophy-a-survey-of-basic-issues-by-nicholas-rescher-in-2000--process-philosophy-a-survey-of-basic-issues-by-nicholas-rescher-in-2000-dot-md}


## [Epistemology An introduction to the theory of knowledge by Nicholas Rescher in 2003]({{< relref "Epistemology_An_introduction_to_the_theory_of_knowledge_by_Nicholas_Rescher_in_2003" >}}) {#epistemology-an-introduction-to-the-theory-of-knowledge-by-nicholas-rescher-in-2003--epistemology-an-introduction-to-the-theory-of-knowledge-by-nicholas-rescher-in-2003-dot-md}


## [pragmatism The Restoration of Its Scientific Roots by Nicholas Rescher in 2012]({{< relref "pragmatism_The_Restoration_of_Its_Scientific_Roots_by_Nicholas_Rescher_in_2012" >}}) {#pragmatism-the-restoration-of-its-scientific-roots-by-nicholas-rescher-in-2012--pragmatism-the-restoration-of-its-scientific-roots-by-nicholas-rescher-in-2012-dot-md}


## [pragmatism in philosophical inquiry by Nicholas Rescher in 2016]({{< relref "pragmatism_in_philosophical_inquiry_by_Nicholas_Rescher_in_2016" >}}) {#pragmatism-in-philosophical-inquiry-by-nicholas-rescher-in-2016--pragmatism-in-philosophical-inquiry-by-nicholas-rescher-in-2016-dot-md}
